femat7/tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/0/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
    }
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    blades
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
